Autodesk.Revit.DB.Architecture.TopographyLinkType.UpdateFileSize(System.Double)
updates the file size
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType.UpdateToposurfaceDataIfNecessary
Updates the external transform and toposurface data for topography link type if the original geometry is far away from the origin.
Remarks:
If the original geometry is farther away from the origin, it should be translated/transformed and the transform should be saved in the TopographyLinkType using this method. This ensures correct reporting of shared coordinates.
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType.SetSurfacesData(System.Collections.Generic.IList{Autodesk.Revit.DB.Architecture.ToposurfaceData})
Sets the surfaces' data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType.ReloadInternal(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.Architecture.ToposurfaceData},System.Boolean)
Reloads the link from curently-stored location.
path:
The path of the link file.
surfacesData:
THe surface data in the link file.
isFromAPI:
True if this method is called by API, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to reload the type.
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new Topography link type.
adoc:
The document in which to create the Topography Link.
path:
The path of the link file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
adoc is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
Fail to access the link file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType.Reload
Loads or reloads the link from its currently-stored location. If the link is an
external resource, Revit will contact the IExternalResourceServer to get the latest version
of the link.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this TopographyLinkType" is in a read-only document.
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType
This class represents the site file brought into the current Revit document.
Since:
2019.2